In [1]:
import numpy as np
import pandas as pd

In [22]:
df = pd.DataFrame({'A': [1,2,np.nan, 4], 
                   'B': [5, np.nan, np.nan, 8], 
                   'C': [10, 20, 30, 40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [8]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [9]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [10]:
df.dropna(axis=1, thresh=2) # thresh requires the number of non-null values; can base this off some percentage

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [11]:
df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [12]:
df.dropna(axis=0, thresh=3)

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [13]:
df.fillna(value='FILL_VALUE') # NOTE: values are converted to ints

            A           B   C
0           1           5  10
1           2  FILL_VALUE  20
2  FILL_VALUE  FILL_VALUE  30
3           4           8  40

In [14]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [17]:
df['A'] = df['A'].fillna(value=0)
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [25]:
df = pd.DataFrame({'A': [1,2,np.nan, 4], 
                   'B': [5, np.nan, np.nan, 8], 
                   'C': [10, 20, 30, 40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [27]:
# Or fill in missing values with the mean for the entire data frame:
df = df.fillna(df.mean())
df

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40